package ua.od.atomspace.сервіс;

import ua.od.atomspace.конфігурація.ФабрикаЕкземплярів;
import ua.od.atomspace.модель.ВідповідьМитніці;
import ua.od.atomspace.модель.Людина;

public class МитнеМіністерствоУкраїни {
    public void початиЗміну() {
        ФабрикаЕкземплярів фабрикаЕкземплярів = new ФабрикаЕкземплярів();
        // зчитати людину
        ЧергаНаКордоні чергаНаКордоні = фабрикаЕкземплярів.взятиЕкземпляр(ЧергаНаКордоніМолдови.class);
        Людина людина = чергаНаКордоні.забратиКрайнього();

        // перевірити людину
        МитницяОдеси митницяОдеси = фабрикаЕкземплярів.взятиЕкземпляр(МитницяОдеси.class);
        ВідповідьМитніці відповідьМитніці = митницяОдеси.обробитиЛюдину(людина);

        //впустити до країни, або депортувати
        МіграційнаСлужба міграційнаСлужба = фабрикаЕкземплярів.взятиЕкземпляр(МіграційнаСлужбаУкраїни.class);
        міграційнаСлужба.мігрувати(відповідьМитніці);
    }
}
